title: An account failed to log on
description: >
  This event generates if an account logon attempt failed when the account was already 
  locked out. It also generates for a logon attempt after which the account was locked out.
  It generates on the computer where logon attempt was made, for example, if logon attempt 
  was made on user’s workstation, then event will be logged on this workstation.
event_id: 4625
attack_data_source: logon session
attack_data_component: logon session creation
platform: windows
provider: Microsoft-Windows-Security-Auditing
channel: Security
atc_id: DN0057
loggingpolicy:
  - LP0004: Failure
contributors:
  - '@atc_project'
references:
  - text: 'Microsoft Docs: Sysinternals: event-4625.md'
    link: 'https://github.com/MicrosoftDocs/windows-itpro-docs/blob/public/windows/security/threat-protection/auditing/event-4625.md'
  - text: 'OSSEM DD: event-4625.yml'
    link: 'https://github.com/OTRF/OSSEM/blob/master/source/data_dictionaries/windows/etw-providers/Microsoft-Windows-Security-Auditing/events/event-4625.yml'
fields:

  - original_name: SubjectUserSid
    description: SID of account that reported information about logon failure.
    sample_value: S-1-5-18
    elastic_ecs_name: user.id
    splunk_cim_name: user_id
    otr_ossem_name: user_reporter_sid

  - original_name: SubjectUserName
    description: the name of the account that reported information about logon failure.
    sample_value: DC01$
    elastic_ecs_name: user.name
    splunk_cim_name: user
    otr_ossem_name: user_reporter_name

  - original_name: SubjectDomainName
    description: subject's domain or computer name
    sample_value: CONTOSO
    elastic_ecs_name: user.domain
    splunk_cim_name: src_nt_domain
    otr_ossem_name: user_reporter_domain

  - original_name: SubjectLogonId
    description: >
      hexadecimal value that can help you correlate this event with recent
      events that might contain the same Logon ID
    sample_value: '0x3e7'
    elastic_ecs_name: winlog.logon.id
    splunk_cim_name: N/A
    otr_ossem_name: user_reporter_id

  - original_name: TargetUserSid
    description: SID of the account that was specified in the logon attempt
    sample_value: S-1-0-0
    elastic_ecs_name: winlog.event_data.TargetUserSid
    splunk_cim_name: N/A
    otr_ossem_name: user_sid

  - original_name: TargetUserName
    description: the name of the account that was specified in the logon attempt
    sample_value: Auditor
    elastic_ecs_name: related.user
    splunk_cim_name: N/A
    otr_ossem_name: user_name

  - original_name: TargetDomainName
    description: subject's domain or computer name
    sample_value: CONTOSO
    elastic_ecs_name: winlog.event_data.TargetDomainName
    splunk_cim_name: dest_nt_domain
    otr_ossem_name: user_domain

  - original_name: Status
    description: >
      the reason why logon failed. For this event it typically has "0xC0000234"
      value
    sample_value: '0xc0000234'
    elastic_ecs_name: winlog.logon.failure.status
    splunk_cim_name: N/A
    otr_ossem_name: event_status

  - original_name: FailureReason
    description: textual explanation of Status field value
    sample_value: '%%2307'
    elastic_ecs_name: winlog.logon.failure.reason
    splunk_cim_name: reason
    otr_ossem_name: event_failure_reason

  - original_name: SubStatus
    description: additional information about logon failure.
    sample_value: '0x0'
    elastic_ecs_name: winlog.logon.failure.sub_status
    splunk_cim_name: N/A
    otr_ossem_name: event_sub_status

  - original_name: LogonType
    description: the type of logon which was performed
    sample_value: '2'
    elastic_ecs_name: winlog.logon.type
    splunk_cim_name: N/A
    otr_ossem_name: logon_type

  - original_name: LogonProcessName
    description: >
      'the name of the trusted logon process that was used for the logon
      attempt. See event "4611: A trusted logon process has been registered with the
      Local Security Authority" description for more information.'
    sample_value: User32
    elastic_ecs_name: winlog.event_data.LogonProcessName
    splunk_cim_name: N/A
    otr_ossem_name: logon_process_name

  - original_name: AuthenticationPackageName
    description: >
      The name of the authentication package which was used for the logon
      authentication process. Default packages loaded on LSA startup are located in
      "HKLM\SYSTEM\CurrentControlSet\Control\Lsa\OSConfig" registry key.
    sample_value: Negotiate
    elastic_ecs_name: winlog.event_data.AuthenticationPackageName
    splunk_cim_name: N/A
    otr_ossem_name: logon_authentication_package_name

  - original_name: WorkstationName
    description: machine name from which logon attempt was performed.
    sample_value: DC01
    elastic_ecs_name: source.domain
    splunk_cim_name: N/A
    otr_ossem_name: src_host_name

  - original_name: TransmittedServices
    description: >
      the list of transmitted services. Transmitted services are populated
      if the logon was a result of a S4U (Service For User) logon process. S4U is a
      Microsoft extension to the Kerberos Protocol to allow an application service to
      obtain a Kerberos service ticket on behalf of a user - most commonly done by a
      front-end website to access an internal resource on behalf of a user.
    sample_value: '-'
    elastic_ecs_name: winlog.event_data.TransmittedServices
    splunk_cim_name: N/A
    otr_ossem_name: logon_transmitted_services

  - original_name: LmPackageName
    description: >
      'The name of the LAN Manager sub-package (NTLM-family protocol name)
      that was used during logon. Possible values are: NTLM V1, NTLM V2, LM. Only populated
      if Authentication Package = NTLM.'
    sample_value: '-'
    elastic_ecs_name: winlog.event_data.LmPackageName
    splunk_cim_name: N/A
    otr_ossem_name: logon_authentication_lan_package_name

  - original_name: KeyLength
    description: >
      the length of NTLM Session Security key. Typically it has 128 bit or
      56 bit length. This parameter is always 0 if "Authentication Package" = "Kerberos",
      because it is not applicable for Kerberos protocol. This field will also have
      "0" value if Kerberos was negotiated using Negotiate authentication package.
    sample_value: '0'
    elastic_ecs_name: winlog.event_data.KeyLength
    splunk_cim_name: N/A
    otr_ossem_name: logon_key_length

  - original_name: ProcessId
    description: >
      hexadecimal Process ID of the process that attempted the logon. Process
      ID (PID) is a number used by the operating system to uniquely identify an active
      process.
    sample_value: '0x1bc'
    elastic_ecs_name: process.pid
    splunk_cim_name: process_id
    otr_ossem_name: process_id

  - original_name: ProcessName
    description: full path and the name of the executable for the process.
    sample_value: C:\Windows\System32\winlogon.exe
    elastic_ecs_name: process.executable
    splunk_cim_name: process_path
    otr_ossem_name: process_path

  - original_name: IpAddress
    description: IP address of machine from which logon attempt was performed
    sample_value: 127.0.0.1
    elastic_ecs_name: source.ip
    splunk_cim_name: src_ip
    otr_ossem_name: src_ip_addr

  - original_name: IpPort
    description: >
      source port which was used for logon attempt from remote machine. 0
      for interactive logons
    sample_value: '0'
    elastic_ecs_name: source.port
    splunk_cim_name: src_port
    otr_ossem_name: src_port

sample: |
  - <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
    - <System>
      <Provider Name="Microsoft-Windows-Security-Auditing" Guid="{54849625-5478-4994-A5BA-3E3B0328C30D}" /> 
      <EventID>4625</EventID> 
      <Version>0</Version> 
      <Level>0</Level> 
      <Task>12546</Task> 
      <Opcode>0</Opcode> 
      <Keywords>0x8010000000000000</Keywords> 
      <TimeCreated SystemTime="2015-09-08T22:54:54.962511700Z" /> 
      <EventRecordID>229977</EventRecordID> 
      <Correlation /> 
      <Execution ProcessID="516" ThreadID="3240" /> 
      <Channel>Security</Channel> 
      <Computer>DC01.contoso.local</Computer> 
      <Security /> 
    </System>
    - <EventData>
      <Data Name="SubjectUserSid">S-1-5-18</Data> 
      <Data Name="SubjectUserName">DC01$</Data> 
      <Data Name="SubjectDomainName">CONTOSO</Data> 
      <Data Name="SubjectLogonId">0x3e7</Data> 
      <Data Name="TargetUserSid">S-1-0-0</Data> 
      <Data Name="TargetUserName">Auditor</Data> 
      <Data Name="TargetDomainName">CONTOSO</Data> 
      <Data Name="Status">0xc0000234</Data> 
      <Data Name="FailureReason">%%2307</Data> 
      <Data Name="SubStatus">0x0</Data> 
      <Data Name="LogonType">2</Data> 
      <Data Name="LogonProcessName">User32</Data> 
      <Data Name="AuthenticationPackageName">Negotiate</Data> 
      <Data Name="WorkstationName">DC01</Data> 
      <Data Name="TransmittedServices">-</Data> 
      <Data Name="LmPackageName">-</Data> 
      <Data Name="KeyLength">0</Data> 
      <Data Name="ProcessId">0x1bc</Data> 
      <Data Name="ProcessName">C:\\Windows\\System32\\winlogon.exe</Data> 
      <Data Name="IpAddress">127.0.0.1</Data> 
      <Data Name="IpPort">0</Data> 
    </EventData>
  </Event>
