title: DN_0112_defender_DeviceImageLoadEvents
author: 'Tom@BridewellConsulting'
description: >
  This datasource contains details information about file creation and modification events as observed by defender for endpoint.  
loggingpolicy: 
  - LP_0111_defender_for_endpoint
references:
  - https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-deviceimageloadevents-table?view=o365-worldwide
category: OS Logs                               
platform: Windows                               
type: defender for endpoint                             
channel: DeviceImageLoadEvents    
fields:
  - Timestamp
  - DeviceId
  - DeviceName
  - ActionType
  - FileName
  - FolderPath
  - SHA1
  - SHA256
  - MD5
  - FileSize
  - InitiatingProcessAccountDomain
  - InitiatingProcessAccountName
  - InitiatingProcessAccountSid
  - InitiatingProcessAccountUpn
  - InitiatingProcessAccountObjectId
  - InitiatingProcessIntegrityLevel
  - InitiatingProcessTokenElevation
  - InitiatingProcessSHA1
  - InitiatingProcessSHA256
  - InitiatingProcessMD5
  - InitiatingProcessFileName
  - InitiatingProcessFileSize
  - InitiatingProcessVersionInfoCompanyName
  - InitiatingProcessVersionInfoProductName
  - InitiatingProcessVersionInfoProductVersion
  - InitiatingProcessVersionInfoInternalFileName
  - InitiatingProcessVersionInfoOriginalFileName
  - InitiatingProcessVersionInfoFileDescription
  - InitiatingProcessId
  - InitiatingProcessCommandLine
  - InitiatingProcessCreationTime
  - InitiatingProcessFolderPath
  - InitiatingProcessParentId
  - InitiatingProcessParentFileName
  - InitiatingProcessParentCreationTime
  - ReportId
  - AppGuardContainerId
